In [2]:
import pandas as pd
import pandasql as psql

## SELECT

### Exercice 1 : Recyclable and Low Fat Products

###### Write a solution to find the ids of products that are both low fat and recyclable. Return the result table in any order. The result format is in the following example. https://leetcode.com/problems/recyclable-and-low-fat-products/description/?envType=study-plan-v2&envId=top-sql-50

In [3]:
data = {
    'product_id': [0, 1, 2, 3, 4],
    'low_fats': ['Y', 'Y', 'N', 'Y', 'N'],
    'recyclable': ['N', 'Y', 'Y', 'Y', 'N']
}

Products = pd.DataFrame(data)
Products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [4]:
query = """
SELECT product_id FROM Products
WHERE low_fats = "Y" AND recyclable = "Y"
"""
psql.sqldf(query, locals())

   product_id
0           1
1           3

### Exercice 2 : Find Customer Referee

###### Find the names of the customer that are not referred by the customer with id = 2. Return the result table in any order. The result format is in the following example. https://leetcode.com/problems/find-customer-referee/description/?envType=study-plan-v2&envId=top-sql-50

In [5]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['Will', 'Jane', 'Alex', 'Bill', 'Zack', 'Mark'],
    'referee_id': [None, None, 2, None, 1, 2]
}
Customer = pd.DataFrame(data)

In [6]:
query = """
SELECT name 
FROM Customer 
WHERE referee_id != 2 OR referee_id IS NOT null
"""
psql.sqldf(query, locals())

   name
0  Alex
1  Zack
2  Mark

### Exercice 3 : Big Countries

###### A country is big if:
###### - it has an area of at least three million (i.e., 3000000 km2), or it has a population of at least twenty-five million (i.e., 25000000).
###### Write a solution to find the name, population, and area of the big countries. Return the result table in any order. The result format is in the following example. https://leetcode.com/problems/big-countries/?envType=study-plan-v2&envId=top-sql-50

In [7]:
world_data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}

World = pd.DataFrame(world_data)
World

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [8]:
query = """
SELECT name, population, area FROM World
WHERE area >= 3000000 OR population >= 25000000
"""
psql.sqldf(query, locals())

          name  population     area
0  Afghanistan    25500100   652230
1      Algeria    37100000  2381741

### Exercice 4 : Article Views I

###### https://leetcode.com/problems/article-views-i/description/?envType=study-plan-v2&envId=top-sql-50

In [9]:
views_data = {
    'article_id': [1, 1, 2, 2, 4, 3, 3],
    'author_id': [3, 3, 7, 7, 7, 4, 4],
    'viewer_id': [5, 6, 7, 6, 1, 4, 4],
    'view_date': ['2019-08-01', '2019-08-02', '2019-08-01', '2019-08-02', '2019-07-22', '2019-07-21', '2019-07-21']
}

Views = pd.DataFrame(views_data)
Views

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [10]:
query = """
SELECT DISTINCT author_id AS id 
FROM Views
WHERE author_id = viewer_id
ORDER BY id ASC 
"""
psql.sqldf(query, locals())

   id
0   4
1   7

### Exercice 5 : Invalid Tweets

###### https://leetcode.com/problems/invalid-tweets/?envType=study-plan-v2&envId=top-sql-50

In [11]:
tweets_data = {
    'tweet_id': [1, 2],
    'content': [
        'Let us Code',
        'More than fifteen chars are here!'
    ]
}

Tweets = pd.DataFrame(tweets_data)
Tweets

   tweet_id                            content
0         1                        Let us Code
1         2  More than fifteen chars are here!

In [13]:
query = """
SELECT tweet_id
FROM Tweets
WHERE length(content) > 15
"""
psql.sqldf(query, locals())

   tweet_id
0         2

## BASIC JOINS

### Exercice 6 : Replace Employee ID With The Unique Identifier
###### https://leetcode.com/problems/replace-employee-id-with-the-unique-identifier/description/?envType=study-plan-v2&envId=top-sql-50

In [14]:
employees_data = {
    'id': [1, 7, 11, 90, 3],
    'name': ['Alice', 'Bob', 'Meir', 'Winston', 'Jonathan']
}

Employees = pd.DataFrame(employees_data)
Employees

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [15]:
employeeuni_data = {
    'id': [3, 11, 90],
    'unique_id': [1, 2, 3]
}

EmployeeUNI = pd.DataFrame(employeeuni_data)
EmployeeUNI

   id  unique_id
0   3          1
1  11          2
2  90          3

In [17]:
query = """
SELECT unique_id, name
FROM Employees e
LEFT JOIN EmployeeUNI eu ON e.id = eu.id
"""
psql.sqldf(query, locals())

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

### Exercice 7 : Product Sales Analysis I
###### https://leetcode.com/problems/product-sales-analysis-i/?envType=study-plan-v2&envId=top-sql-50

In [20]:
sales_data = {
    'sale_id': [1, 2, 7],
    'product_id': [100, 100, 200],
    'year': [2008, 2009, 2011],
    'quantity': [10, 12, 15],
    'price': [5000, 5000, 9000]
}

Sales = pd.DataFrame(sales_data)
Sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [18]:
product_data = {
    'product_id': [100, 200, 300],
    'product_name': ['Nokia', 'Apple', 'Samsung']
}

# Cr√©ation du DataFrame pour Product
Product = pd.DataFrame(product_data)
Product

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [22]:
query = """
SELECT product_name, year, price
FROM Sales
JOIN Product ON Sales.product_id = Product.product_id
"""
psql.sqldf(query, locals())

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

### Exercice 8 : Customer Who Visited But Did Not Make Any Transactions
###### https://leetcode.com/problems/customer-who-visited-but-did-not-make-any-transactions/description/?envType=study-plan-v2&envId=top-sql-50

In [23]:
visits_data = {
    'visit_id': [1, 2, 4, 5, 6, 7, 8],
    'customer_id': [23, 9, 30, 54, 96, 54, 54]
}

Visits = pd.DataFrame(visits_data)
Visits

   visit_id  customer_id
0         1           23
1         2            9
2         4           30
3         5           54
4         6           96
5         7           54
6         8           54

In [24]:
transactions_data = {
    'transaction_id': [2, 3, 9, 12, 13],
    'visit_id': [5, 5, 5, 1, 2],
    'amount': [310, 300, 200, 910, 970]
}

Transactions = pd.DataFrame(transactions_data)
Transactions

   transaction_id  visit_id  amount
0               2         5     310
1               3         5     300
2               9         5     200
3              12         1     910
4              13         2     970

In [25]:
query = """
SELECT customer_id, count(*) AS count_no_trans
FROM Visits
LEFT JOIN Transactions ON Transactions.visit_id = Visits.visit_id
WHERE Transactions.transaction_id IS NULL
GROUP BY customer_id
"""
psql.sqldf(query, locals())

   customer_id  count_no_trans
0           30               1
1           54               2
2           96               1

### Exercice 9 : Rising Temperature
###### https://leetcode.com/problems/rising-temperature/description/?envType=study-plan-v2&envId=top-sql-50

In [26]:
weather_data = {
    'id': [1, 2, 3, 4],
    'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
    'temperature': [10, 25, 20, 30]
}

Weather = pd.DataFrame(weather_data)
Weather

   id  recordDate  temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           30

In [28]:
# Fonctionne sous MySQL mais pas sous SQLite
query = """
SELECT w.id
FROM Weather
JOIN Weather w ON DATEDIFF(Weather.recordDate, w.recordDate) = -1
WHERE w.temperature > Weather.temperature
"""
psql.sqldf(query, locals())

PandaSQLException: (sqlite3.OperationalError) no such function: DATEDIFF
[SQL:
SELECT w.id
FROM Weather
JOIN Weather w ON DATEDIFF(Weather.recordDate, w.recordDate) = -1
WHERE w.temperature > Weather.temperature
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [31]:
# SQLite (attention, pas le m√™me output bizaremment)
query = """
SELECT w.id
FROM Weather
JOIN Weather w ON Weather.recordDate = DATE(w.recordDate, '+1 day')
WHERE w.temperature > Weather.temperature;
"""
psql.sqldf(query, locals())

   id
0   2

### Exercice 10 : Average Time of Process per Machine
###### https://leetcode.com/problems/average-time-of-process-per-machine/?envType=study-plan-v2&envId=top-sql-50

In [32]:

activity_data = {
    'machine_id': [0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2],
    'process_id': [0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1],
    'activity_type': ['start', 'end', 'start', 'end', 
                      'start', 'end', 'start', 'end', 
                      'start', 'end', 'start', 'end'],
    'timestamp': [0.712, 1.520, 3.140, 4.120, 
                  0.550, 1.550, 0.430, 1.420, 
                  4.100, 4.512, 2.500, 5.000]
}

Activity = pd.DataFrame(activity_data)
Activity

    machine_id  process_id activity_type  timestamp
0            0           0         start      0.712
1            0           0           end      1.520
2            0           1         start      3.140
3            0           1           end      4.120
4            1           0         start      0.550
5            1           0           end      1.550
6            1           1         start      0.430
7            1           1           end      1.420
8            2           0         start      4.100
9            2           0           end      4.512
10           2           1         start      2.500
11           2           1           end      5.000

In [33]:
query = """
SELECT a1.machine_id, ROUND(AVG(a2.timestamp - a1.timestamp), 3) AS processing_time
FROM Activity a1
JOIN Activity a2 ON a1.machine_id = a2.machine_id
    AND a1.process_id = a2.process_id
    AND a1.activity_type = "start"
    AND a2.activity_type = "end"
GROUP BY a1.machine_id
"""

psql.sqldf(query, locals())

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456

### Exercice 11 : Employee Bonus
###### https://leetcode.com/problems/employee-bonus/description/?envType=study-plan-v2&envId=top-sql-50

In [34]:
employee_data = {
    'empId': [3, 1, 2, 4],
    'name': ['Brad', 'John', 'Dan', 'Thomas'],
    'supervisor': [None, 3, 3, 3],
    'salary': [4000, 1000, 2000, 4000]
}
Employee = pd.DataFrame(employee_data)
Employee

   empId    name  supervisor  salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [35]:
bonus_data = {
    'empId': [2, 4],
    'bonus': [500, 2000]
}

Bonus = pd.DataFrame(bonus_data)
Bonus

   empId  bonus
0      2    500
1      4   2000

In [36]:
query = """
SELECT name, bonus
FROM Employee
LEFT JOIN Bonus
ON Employee.empId = Bonus.empId
WHERE bonus < 1000 OR bonus IS null
"""
psql.sqldf(query, locals())

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0

### Exercice 12 : Students and Examinations
###### https://leetcode.com/problems/students-and-examinations/?envType=study-plan-v2&envId=top-sql-50

In [37]:
student_data = {
    'student_id': [1, 2, 13, 6],
    'student_name': ['Alice', 'Bob', 'John', 'Alex']
}

Students = pd.DataFrame(student_data)
Students

   student_id student_name
0           1        Alice
1           2          Bob
2          13         John
3           6         Alex

In [38]:
subject_data = {
    'subject_name': ['Math', 'Physics', 'Programming']
}

Subjects = pd.DataFrame(subject_data)
Subjects

  subject_name
0         Math
1      Physics
2  Programming

In [39]:
examination_data = {
    'student_id': [1, 1, 1, 2, 1, 1, 13, 13, 13, 2, 1],
    'subject_name': ['Math', 'Physics', 'Programming', 'Programming', 'Physics', 'Math', 'Math', 'Programming', 'Physics', 'Math', 'Math']
}

Examinations = pd.DataFrame(examination_data)
Examinations

    student_id subject_name
0            1         Math
1            1      Physics
2            1  Programming
3            2  Programming
4            1      Physics
5            1         Math
6           13         Math
7           13  Programming
8           13      Physics
9            2         Math
10           1         Math

In [40]:
query = """
SELECT Students.student_id, Students.student_name, Subjects.subject_name, COUNT(Examinations.subject_name) AS attended_exams
FROM Students
CROSS JOIN Subjects
LEFT JOIN Examinations
ON Examinations.student_id = Students.student_id AND Examinations.subject_name = Subjects.subject_name
GROUP BY Students.student_id, Students.student_name, Subjects.subject_name
ORDER BY Students.student_id ASC
"""
psql.sqldf(query, locals())

    student_id student_name subject_name  attended_exams
0            1        Alice         Math               3
1            1        Alice      Physics               2
2            1        Alice  Programming               1
3            2          Bob         Math               1
4            2          Bob      Physics               0
5            2          Bob  Programming               1
6            6         Alex         Math               0
7            6         Alex      Physics               0
8            6         Alex  Programming               0
9           13         John         Math               1
10          13         John      Physics               1
11          13         John  Programming               1

### Exercice 13 : Managers with at Least 5 Direct Reports
###### https://leetcode.com/problems/managers-with-at-least-5-direct-reports/?envType=study-plan-v2&envId=top-sql-50

In [41]:
employee_data = {
    'id': [101, 102, 103, 104, 105, 106],
    'name': ['John', 'Dan', 'James', 'Amy', 'Anne', 'Ron'],
    'department': ['A', 'A', 'A', 'A', 'A', 'B'],
    'managerId': [None, 101, 101, 101, 101, 101]
}

Employee = pd.DataFrame(employee_data)
Employee

    id   name department  managerId
0  101   John          A        NaN
1  102    Dan          A      101.0
2  103  James          A      101.0
3  104    Amy          A      101.0
4  105   Anne          A      101.0
5  106    Ron          B      101.0

In [42]:
query = """
SELECT e1.name
FROM Employee e1
JOIN Employee e2 ON e1.id = e2.managerId
GROUP BY e2.managerId
HAVING COUNT(e1.id) >= 5
"""
psql.sqldf(query, locals())

   name
0  John

### Exercice 14 : Confirmation Rate
###### https://leetcode.com/problems/confirmation-rate/description/?envType=study-plan-v2&envId=top-sql-50

In [43]:
signups_data = {
    'user_id': [3, 7, 2, 6],
    'time_stamp': [
        '2020-03-21 10:16:13',
        '2020-01-04 13:57:59',
        '2020-07-29 23:09:44',
        '2020-12-09 10:39:37'
    ]
}

Signups = pd.DataFrame(signups_data)
Signups

   user_id           time_stamp
0        3  2020-03-21 10:16:13
1        7  2020-01-04 13:57:59
2        2  2020-07-29 23:09:44
3        6  2020-12-09 10:39:37

In [44]:
confirmations_data = {
    'user_id': [3, 3, 7, 7, 7, 2, 2],
    'time_stamp': [
        '2021-01-06 03:30:46',
        '2021-07-14 14:00:00',
        '2021-06-12 11:57:29',
        '2021-06-13 12:58:28',
        '2021-06-14 13:59:27',
        '2021-01-22 00:00:00',
        '2021-02-28 23:59:59'
    ],
    'action': ['timeout', 'timeout', 'confirmed', 'confirmed', 'confirmed', 'confirmed', 'timeout']
}

Confirmations = pd.DataFrame(confirmations_data)
Confirmations

   user_id           time_stamp     action
0        3  2021-01-06 03:30:46    timeout
1        3  2021-07-14 14:00:00    timeout
2        7  2021-06-12 11:57:29  confirmed
3        7  2021-06-13 12:58:28  confirmed
4        7  2021-06-14 13:59:27  confirmed
5        2  2021-01-22 00:00:00  confirmed
6        2  2021-02-28 23:59:59    timeout

In [46]:
# Fonctionne avec MySQL
query = """
SELECT s.user_id, round(avg(if(c.action="confirmed",1,0)),2) AS confirmation_rate
FROM Signups AS s
LEFT JOIN Confirmations AS c ON s.user_id = c.user_id
GROUP BY user_id;
"""
psql.sqldf(query, locals())

PandaSQLException: (sqlite3.OperationalError) no such function: if
[SQL:
SELECT s.user_id, round(avg(if(c.action="confirmed",1,0)),2) AS confirmation_rate
FROM Signups AS s
LEFT JOIN Confirmations AS c ON s.user_id = c.user_id
GROUP BY user_id;
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [48]:
# SQLite version
query = """
SELECT s.user_id, round(avg(CASE WHEN c.action = 'confirmed' THEN 1 ELSE 0 END), 2) AS confirmation_rate
FROM Signups AS s
LEFT JOIN Confirmations AS c ON s.user_id = c.user_id
GROUP BY s.user_id;
"""
psql.sqldf(query, locals())

   user_id  confirmation_rate
0        2                0.5
1        3                0.0
2        6                0.0
3        7                1.0

## BASIC AGGREGATE FUNCTIONS

### Exercice 15 : Not Boring Movies
###### https://leetcode.com/problems/not-boring-movies/?envType=study-plan-v2&envId=top-sql-50

In [49]:
cinema_data = {
    'id': [1, 2, 3, 4, 5],
    'movie': ['War', 'Science', 'irish', 'Ice song', 'House card'],
    'description': ['great 3D', 'fiction', 'boring', 'Fantacy', 'Interesting'],
    'rating': [8.9, 8.5, 6.2, 8.6, 9.1]
}

Cinema = pd.DataFrame(cinema_data)
Cinema

   id       movie  description  rating
0   1         War     great 3D     8.9
1   2     Science      fiction     8.5
2   3       irish       boring     6.2
3   4    Ice song      Fantacy     8.6
4   5  House card  Interesting     9.1

In [50]:
query = """
SELECT *
FROM Cinema
WHERE (id % 2) = 1 AND description != "boring"
ORDER BY rating DESC
"""
psql.sqldf(query, locals())

   id       movie  description  rating
0   5  House card  Interesting     9.1
1   1         War     great 3D     8.9

### Exercice 16 : Average Selling Price
###### https://leetcode.com/problems/average-selling-price/description/?envType=study-plan-v2&envId=top-sql-50

In [51]:
prices_data = {
    'product_id': [1, 1, 2, 2],
    'start_date': ['2019-02-17', '2019-03-01', '2019-02-01', '2019-02-21'],
    'end_date': ['2019-02-28', '2019-03-22', '2019-02-20', '2019-03-31'],
    'price': [5, 20, 15, 30]
}

Prices = pd.DataFrame(prices_data)
Prices

   product_id  start_date    end_date  price
0           1  2019-02-17  2019-02-28      5
1           1  2019-03-01  2019-03-22     20
2           2  2019-02-01  2019-02-20     15
3           2  2019-02-21  2019-03-31     30

In [52]:
units_sold_data = {
    'product_id': [1, 1, 2, 2],
    'purchase_date': ['2019-02-25', '2019-03-01', '2019-02-10', '2019-03-22'],
    'units': [100, 15, 200, 30]
}

UnitsSold = pd.DataFrame(units_sold_data)
UnitsSold

   product_id purchase_date  units
0           1    2019-02-25    100
1           1    2019-03-01     15
2           2    2019-02-10    200
3           2    2019-03-22     30

In [54]:
query = """
SELECT p.product_id, IFNULL(ROUND(SUM(units*price)/SUM(units),2),0) AS average_price
FROM Prices p
LEFT JOIN UnitsSold u
ON p.product_id = u.product_id AND u.purchase_date BETWEEN start_date AND end_date
GROUP BY p.product_id
"""
psql.sqldf(query, locals())

   product_id  average_price
0           1            6.0
1           2           16.0

### Exercice 17 : Project Employees I
###### https://leetcode.com/problems/project-employees-i/description/?envType=study-plan-v2&envId=top-sql-50

In [61]:
project_data = {
    'project_id': [1, 1, 1, 2, 2],
    'employee_id': [1, 2, 3, 1, 4]
}

Project = pd.DataFrame(project_data)
Project

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

In [62]:
employee_data = {
    'employee_id': [1, 2, 3, 4],
    'name': ['Khaled', 'Ali', 'John', 'Doe'],
    'experience_years': [3, 2, 1, 2]
}

Employee = pd.DataFrame(employee_data)
Employee

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 1
3            4     Doe                 2

In [63]:
query = """
SELECT p.project_id, ROUND(AVG(e.experience_years),2) AS average_years
FROM Project p
LEFT JOIN Employee e on e.employee_id = p.employee_id
GROUP BY p.project_id
"""
psql.sqldf(query, locals())

   project_id  average_years
0           1            2.0
1           2            2.5

### Exercice 18 : Percentage of Users Attended a Contest
###### https://leetcode.com/problems/percentage-of-users-attended-a-contest/description/?envType=study-plan-v2&envId=top-sql-50

In [65]:
users_data = {
    'user_id': [6, 2, 7],
    'user_name': ['Alice', 'Bob', 'Alex']
}

Users = pd.DataFrame(users_data)
Users

   user_id user_name
0        6     Alice
1        2       Bob
2        7      Alex

In [66]:
register_data = {
    'contest_id': [215, 209, 208, 210, 208, 209, 209, 215, 208, 210, 207, 210],
    'user_id': [6, 2, 2, 6, 6, 7, 6, 7, 7, 2, 2, 7]
}

Register = pd.DataFrame(register_data)
Register

    contest_id  user_id
0          215        6
1          209        2
2          208        2
3          210        6
4          208        6
5          209        7
6          209        6
7          215        7
8          208        7
9          210        2
10         207        2
11         210        7

In [67]:
query = """
SELECT contest_id, 
    ROUND(COUNT(DISTINCT user_id) * 100 / (SELECT COUNT(user_id) FROM Users), 2) AS percentage
FROM Register r
GROUP BY r.contest_id
ORDER BY percentage DESC, r.contest_id ASC
"""
psql.sqldf(query, locals())

   contest_id  percentage
0         208       100.0
1         209       100.0
2         210       100.0
3         215        66.0
4         207        33.0

### Exercice 19 : Queries Quality and Percentage 
###### https://leetcode.com/problems/queries-quality-and-percentage/description/?envType=study-plan-v2&envId=top-sql-50

In [68]:
data = {
    'query_name': ['Dog', 'Dog', 'Dog', 'Cat', 'Cat', 'Cat'],
    'result': ['Golden Retriever', 'German Shepherd', 'Mule', 'Shirazi', 'Siamese', 'Sphynx'],
    'position': [1, 2, 200, 5, 3, 7],
    'rating': [5, 5, 1, 2, 3, 4]
}

Queries = pd.DataFrame(data)
Queries

  query_name            result  position  rating
0        Dog  Golden Retriever         1       5
1        Dog   German Shepherd         2       5
2        Dog              Mule       200       1
3        Cat           Shirazi         5       2
4        Cat           Siamese         3       3
5        Cat            Sphynx         7       4

In [69]:
query = """
SELECT query_name,
    ROUND(AVG(rating/position),2) AS quality,
    ROUND(SUM(CASE WHEN rating < 3 THEN 100 ELSE 0 END)/COUNT(rating),2) AS poor_query_percentage
FROM Queries
WHERE query_name IS NOT NULL
GROUP BY query_name
"""
psql.sqldf(query, locals())

  query_name  quality  poor_query_percentage
0        Cat     0.33                   33.0
1        Dog     2.33                   33.0

### Exercice 20 : Monthly Transactions I
###### https://leetcode.com/problems/monthly-transactions-i/?envType=study-plan-v2&envId=top-sql-50

In [70]:
data = {
    'id': [121, 122, 123, 124],
    'country': ['US', 'US', 'US', 'DE'],
    'state': ['approved', 'declined', 'approved', 'approved'],
    'amount': [1000, 2000, 2000, 2000],
    'trans_date': ['2018-12-18', '2018-12-19', '2019-01-01', '2019-01-07']
}
Transactions = pd.DataFrame(data)
Transactions

    id country     state  amount  trans_date
0  121      US  approved    1000  2018-12-18
1  122      US  declined    2000  2018-12-19
2  123      US  approved    2000  2019-01-01
3  124      DE  approved    2000  2019-01-07

In [71]:
# Fonctionne avec MySQL
query = """
SELECT DATE_FORMAT(trans_date, '%Y-%m') AS month,
    country,
    COUNT(*) AS trans_count,
    COUNT(CASE WHEN state = 'approved' THEN 1 END) AS approved_count,
    SUM(amount) AS trans_total_amount,
    SUM(CASE WHEN state = "approved" THEN amount ELSE 0 END) AS approved_total_amount
FROM Transactions
GROUP BY country, month
"""
psql.sqldf(query, locals())

PandaSQLException: (sqlite3.OperationalError) no such function: DATE_FORMAT
[SQL:
SELECT DATE_FORMAT(trans_date, '%Y-%m') AS month,
    country,
    COUNT(*) AS trans_count,
    COUNT(CASE WHEN state = 'approved' THEN 1 END) AS approved_count,
    SUM(amount) AS trans_total_amount,
    SUM(CASE WHEN state = "approved" THEN amount ELSE 0 END) AS approved_total_amount
FROM Transactions
GROUP BY country, month
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [72]:
# SQLite version
query = """
SELECT strftime('%Y-%m', trans_date) AS month,
       country,
       COUNT(*) AS trans_count,
       COUNT(CASE WHEN state = 'approved' THEN 1 END) AS approved_count,
       SUM(amount) AS trans_total_amount,
       SUM(CASE WHEN state = 'approved' THEN amount ELSE 0 END) AS approved_total_amount
FROM Transactions
GROUP BY country, month;
"""
psql.sqldf(query, locals())

,month,country,trans_count,approved_count,trans_total_amount,approved_total_amount
0,2019-01,DE,1,1,2000,2000
1,2018-12,US,2,1,3000,1000
2,2019-01,US,1,1,2000,2000

### Exercice 21 : Immediate Food Delivery II
###### https://leetcode.com/problems/immediate-food-delivery-ii/description/?envType=study-plan-v2&envId=top-sql-50

In [55]:
delivery_data = {
    'delivery_id': [1, 2, 3, 4, 5, 6, 7],
    'customer_id': [1, 2, 1, 3, 3, 2, 4],
    'order_date': ['2019-08-01', '2019-08-02', '2019-08-11', '2019-08-24', '2019-08-21', '2019-08-11', '2019-08-09'],
    'customer_pref_delivery_date': ['2019-08-02', '2019-08-02', '2019-08-12', '2019-08-24', '2019-08-22', '2019-08-13', '2019-08-09']
}

Delivery = pd.DataFrame(delivery_data)
Delivery

   delivery_id  customer_id  order_date customer_pref_delivery_date
0            1            1  2019-08-01                  2019-08-02
1            2            2  2019-08-02                  2019-08-02
2            3            1  2019-08-11                  2019-08-12
3            4            3  2019-08-24                  2019-08-24
4            5            3  2019-08-21                  2019-08-22
5            6            2  2019-08-11                  2019-08-13
6            7            4  2019-08-09                  2019-08-09

In [57]:
# Fonctionne en MySQL
query = """

-- √âtape 1 : Obtenir la premi√®re date de commande pour chaque client

WITH first_order_date AS (
    SELECT customer_id, MIN(order_date) AS first_order_date
    FROM Delivery
    GROUP BY customer_id
),

-- √âtape 2 : Joindre les commandes sur la premi√®re commande et v√©rifier si elles sont imm√©diates
immediate_or_not AS (
    SELECT d.customer_id, 
           IF(d.order_date = d.customer_pref_delivery_date, 1, 0) AS is_immediate
    FROM Delivery d
    JOIN first_order_date fod 
      ON d.customer_id = fod.customer_id 
     AND d.order_date = fod.first_order_date
)

-- √âtape 3 : Calculer le pourcentage de livraisons imm√©diates sur les premi√®res commandes
SELECT 
    ROUND(SUM(i.is_immediate) / COUNT(*) * 100, 2) AS immediate_percentage
FROM immediate_or_not i;
"""
psql.sqldf(query, locals())

PandaSQLException: (sqlite3.OperationalError) no such function: IF
[SQL:

-- √âtape 1 : Obtenir la premi√®re date de commande pour chaque client

WITH first_order_date AS (
    SELECT customer_id, MIN(order_date) AS first_order_date
    FROM Delivery
    GROUP BY customer_id
),

-- √âtape 2 : Joindre les commandes sur la premi√®re commande et v√©rifier si elles sont imm√©diates
immediate_or_not AS (
    SELECT d.customer_id,
           IF(d.order_date = d.customer_pref_delivery_date, 1, 0) AS is_immediate
    FROM Delivery d
    JOIN first_order_date fod
      ON d.customer_id = fod.customer_id
     AND d.order_date = fod.first_order_date
)

-- √âtape 3 : Calculer le pourcentage de livraisons imm√©diates sur les premi√®res commandes
SELECT
    ROUND(SUM(i.is_immediate) / COUNT(*) * 100, 2) AS immediate_percentage
FROM immediate_or_not i;
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [64]:
# SQLite version
query = """

WITH first_order_date AS (
    SELECT customer_id, MIN(order_date) AS first_order_date
    FROM Delivery
    GROUP BY customer_id
),

immediate_or_not AS (
    SELECT d.customer_id, 
           CASE WHEN d.order_date = d.customer_pref_delivery_date THEN 1 ELSE 0 END AS is_immediate
    FROM Delivery d
    JOIN first_order_date fod 
      ON d.customer_id = fod.customer_id 
     AND d.order_date = fod.first_order_date
)

SELECT 
    ROUND(SUM(i.is_immediate) * 1.0 / COUNT(*) * 100, 2) AS immediate_percentage
FROM immediate_or_not i;

"""
psql.sqldf(query, locals())

   immediate_percentage
0                  50.0

### Exercice 22 : Game Play Analysis IV
###### https://leetcode.com/problems/game-play-analysis-iv/?envType=study-plan-v2&envId=top-sql-50

In [59]:
activity_data = {
    'player_id': [1, 1, 2, 3, 3],
    'device_id': [2, 2, 3, 1, 4],
    'event_date': ['2016-03-01', '2016-03-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5, 6, 1, 0, 5]
}

Activity = pd.DataFrame(activity_data)
Activity

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-03-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [74]:
# Fonctionne en MySQL
query = """
WITH user_activity AS (
    SELECT player_id,
           MIN(event_date) AS first_login_date
    FROM Activity
    GROUP BY player_id
)

SELECT ROUND(
    COUNT(DISTINCT CASE 
        WHEN EXISTS (
            SELECT 1 
            FROM Activity a2 
            WHERE a2.player_id = ua.player_id 
            AND DATEDIFF(a2.event_date, ua.first_login_date) = 1
        ) THEN ua.player_id
    END) * 1.0 / COUNT(*), 
2) AS fraction
FROM user_activity ua;

"""
psql.sqldf(query, locals())

PandaSQLException: (sqlite3.OperationalError) no such function: DATEDIFF
[SQL:
WITH user_activity AS (
    SELECT player_id,
           MIN(event_date) AS first_login_date
    FROM Activity
    GROUP BY player_id
)

SELECT ROUND(
    COUNT(DISTINCT CASE
        WHEN EXISTS (
            SELECT 1
            FROM Activity a2
            WHERE a2.player_id = ua.player_id
            AND DATEDIFF(a2.event_date, ua.first_login_date) = 1
        ) THEN ua.player_id
    END) * 1.0 / COUNT(*),
2) AS fraction
FROM user_activity ua;

]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [76]:
# SQLite version
query = """
WITH user_activity AS (
    SELECT player_id,
           MIN(event_date) AS first_login_date
    FROM Activity
    GROUP BY player_id
)

SELECT ROUND(
    COUNT(DISTINCT CASE 
        WHEN EXISTS (
            SELECT 1 
            FROM Activity a2 
            WHERE a2.player_id = ua.player_id 
            AND julianday(a2.event_date) - julianday(ua.first_login_date) = 1
        ) THEN ua.player_id
    END) * 1.0 / COUNT(*), 
2) AS fraction
FROM user_activity ua;
"""
psql.sqldf(query, locals())

   fraction
0      0.33

## SORTING AND GROUPING

### Exercise 23 : Number of Unique Subjects Taught by Each Teacher
###### https://leetcode.com/problems/number-of-unique-subjects-taught-by-each-teacher/description/?envType=study-plan-v2&envId=top-sql-50

In [78]:
# Dictionnaire repr√©sentant la table Teacher
teacher_data = [
    {"teacher_id": 1, "subject_id": 2, "dept_id": 3},
    {"teacher_id": 1, "subject_id": 2, "dept_id": 4},
    {"teacher_id": 1, "subject_id": 3, "dept_id": 3},
    {"teacher_id": 2, "subject_id": 1, "dept_id": 1},
    {"teacher_id": 2, "subject_id": 2, "dept_id": 1},
    {"teacher_id": 2, "subject_id": 3, "dept_id": 1},
    {"teacher_id": 2, "subject_id": 4, "dept_id": 1},
]
Teacher = pd.DataFrame(teacher_data)
Teacher

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [79]:
query = """
SELECT teacher_id, COUNT(DISTINCT subject_id) AS cnt
FROM Teacher
GROUP BY teacher_id
"""
psql.sqldf(query, locals())

   teacher_id  cnt
0           1    2
1           2    4

### Exercise 24 : User Activity for the Past 30 Days I
###### https://leetcode.com/problems/user-activity-for-the-past-30-days-i/description/?envType=study-plan-v2&envId=top-sql-50

In [80]:
activity_data = [
    {"user_id": 1, "session_id": 1, "activity_date": "2019-07-20", "activity_type": "open_session"},
    {"user_id": 1, "session_id": 1, "activity_date": "2019-07-20", "activity_type": "scroll_down"},
    {"user_id": 1, "session_id": 1, "activity_date": "2019-07-20", "activity_type": "end_session"},
    {"user_id": 2, "session_id": 4, "activity_date": "2019-07-20", "activity_type": "open_session"},
    {"user_id": 2, "session_id": 4, "activity_date": "2019-07-21", "activity_type": "send_message"},
    {"user_id": 2, "session_id": 4, "activity_date": "2019-07-21", "activity_type": "end_session"},
    {"user_id": 3, "session_id": 2, "activity_date": "2019-07-21", "activity_type": "open_session"},
    {"user_id": 3, "session_id": 2, "activity_date": "2019-07-21", "activity_type": "send_message"},
    {"user_id": 3, "session_id": 2, "activity_date": "2019-07-21", "activity_type": "end_session"},
    {"user_id": 4, "session_id": 3, "activity_date": "2019-06-25", "activity_type": "open_session"},
    {"user_id": 4, "session_id": 3, "activity_date": "2019-06-25", "activity_type": "end_session"},
]
Activity = pd.DataFrame(activity_data)
Activity

    user_id  session_id activity_date activity_type
0         1           1    2019-07-20  open_session
1         1           1    2019-07-20   scroll_down
2         1           1    2019-07-20   end_session
3         2           4    2019-07-20  open_session
4         2           4    2019-07-21  send_message
5         2           4    2019-07-21   end_session
6         3           2    2019-07-21  open_session
7         3           2    2019-07-21  send_message
8         3           2    2019-07-21   end_session
9         4           3    2019-06-25  open_session
10        4           3    2019-06-25   end_session